<template>
  <div class="about-view">
    <h1>Структура кампании</h1>

    <h2>Дерево</h2>
    <ul>

      <li>
        Дирекция (Дирекция)

        <ul>
          <li>
            Финансово-экономический департамент
            <ul>
              <li>Бухгалтерия (Отдел)</li>
              <li>Юристы (Отдел)</li>
              <li>Делопроизводство (Отдел)</li>
            </ul>
          </li>

          <li>
            Производственный департамент
            <ul>
              <li>Цех металлообработки</li>
              <li>Швейный цех</li>
            </ul>
          </li>

          <li>
            Департамент логистики
            <ul>
              <li>Отдел логистики</li>
              <li>Отдел закупок</li>
              <li>Склад</li>
              <li>Сборка швейных изделий</li>
              <li>Монтажные бригады</li>
            </ul>
          </li>

          <li>
            Департамент информационных технологий
            <ul>
              <li>Отдел разработки</li>
              <li>Отдел автоматизации</li>
              <li>Техническая поддержка</li>
            </ul>
          </li>

          <li>
            Коммерческий департамент
            <ul>
              <li>Отдел продаж и работы с клиентами</li>
              <li>Тендерный отдел</li>
              <li>Отдел работы с дилерами</li>
            </ul>
          </li>

          <li>
            Департамент маркетинга
            <ul>
              <li>Отдел стратегического развития</li>
              <li>Отдел интернет-маркетинга</li>
              <li>Контент-отдел</li>
            </ul>
          </li>
          <li>
            Отдел персонала (департамент без отделов)
          </li>
        </ul>

      </li>


    </ul>

    <h2>ТЗ</h2>
    <h3>Различия между глубиной отдела</h3>
    <p>
      Дирекция, департамент, отдел и подотдел являются экземплярами одной и той-же сущности. <br>
      Любой отдел, который вложен в другой отдел на любую глубину будет называться подотделом. <br>
      Отличия между ними лишь визуальные:
    </p>
    <ul>
      <li>Корневой отдел нельзя удалить, переименовать</li>
      <li>Корневой отдел нельзя перенести в другой отдел</li>
      <li>У каждого типа возможно свой цвет</li>
      <li>Подсказку у кнопки добавления потомка разная: добавить департамент/отдел/подотдел</li>
    </ul>
    <h3>На строке отдела выводятся:</h3>
    <ul>
      <li>Название отдела</li>
      <li>ФИО руководителя (и ссылка на страницу редактирования)</li>
      <li>Кнопка удаления</li>
      <li>Кнопка добавления потомка</li>
      <li>Кнопка редактирования</li>
    </ul>

    <h3>Добавление/редактирование отдела</h3>
    <p> происходит в диалоговом окне</p>
    <p>Там всего 2 поля:</p>
    <ul>
      <li>Название</li>
      <li>Руководитель</li>
    </ul>


    <h3>Перетаскивание отдела</h3>
    <ol>
      <li>Захватить можно любой отдел (Кроме корневого) за специальное место для захвата</li>
      <li>Бросить отдел можно когда он наведен на строку другого отдела</li>
      <li>Там ещё нужно будет обдумать варианты когда отдел переносится в своего потомка, но это уже в процессе работы над перетаскиванием</li>
    </ol>


    <h3>Поля для Отдела (Department)</h3>
    <ul>
      <li>Название (Строка)</li>
      <li>Руководитель (hasOne Employee)</li>
      <li>Сотрудники (hasMany Employee)</li>
      <li>Дочерние отделы (hasMany Departments)</li>
      <li>Родительский отдел (hasOne Department)</li>
    </ul>
  </div>
</template>

<style>

</style>
