<template>
  <div class="about-view">
    <h1>Структура кампании</h1>

    <h2>Дерево</h2>
    <ul>

      <li>
        Дирекция (Дирекция)

        <ul>
          <li>
            Департамент информационных технологий
            <ul>
              <li>Разработка (Отдел)</li>
              <li>Автоматизация (Отдел)</li>
              <li>Техническая Поддержка (Отдел)</li>
            </ul>
          </li>

          <li>
            Финансово-экономический департамент
            <ul>
              <li>Бухгалтерия (Отдел)</li>
              <li>Юристы (Отдел)</li>
              <li>Делопроизводство (Отдел)</li>
            </ul>
          </li>

          <li>
            Департамент логистики
            <ul>
              <li>Отдел логистики</li>
              <li>Отдел закупок</li>
              <li>Склад</li>
              <li>Сборка швейных изделий</li>
              <li>Монтажные бригады</li>
            </ul>
          </li>

          <li>
            Производственный департамент
            <ul>
              <li>Цех металлообработки</li>
              <li>Швейный цех</li>
            </ul>
          </li>

          <li>
            Департамент информационных технологий
            <ul>
              <li>Отдел разработки</li>
              <li>Отдел автоматизации</li>
              <li>Техническая поддержка</li>
            </ul>
          </li>

          <li>
            Коммерческий департамент
            <ul>
              <li>Отдел продаж и работы с клиентами</li>
              <li>Тендерный отдел</li>
              <li>Отдел работы с дилерами</li>
            </ul>
          </li>

          <li>
            Департамент маркетинга
            <ul>
              <li>Отдел стратегического развития</li>
              <li>Отдел интернет-маркетинга</li>
              <li>Контент-отдел</li>
            </ul>
          </li>
        </ul>

      </li>


    </ul>

    <h2>Поля для Дирекции (Directorate)</h2>
    <ul>
      <li>Название (Строка)</li>
      <li>Руководитель (hasOne Employee)</li>
      <li>Сотрудники (hasMany Employee)</li>
      <li>Родительский отдел (hasOne Department Nullable)</li>
    </ul>

    <h2>Поля для Департамента (Department)</h2>
    <ul>
      <li>Название (Строка)</li>
      <li>Руководитель (hasOne Employee)</li>
      <li>Сотрудники (hasMany Employee)</li>
      <li>Родительский отдел (hasOne Department Nullable)</li>
    </ul>

    <h2>Поля для отдела (Division)</h2>
    <ul>
      <li>Название (Строка)</li>
      <li>Руководитель (hasOne Employee)</li>
      <li>Сотрудники (hasMany Employee)</li>
      <li>Родительский отдел (hasOne Department Nullable)</li>
    </ul>


    <h2>Прочие заметки</h2>

  </div>
</template>

<style>

</style>
