<template>
  <div class="about-view">
    <h1>Структура кампании</h1>

    <h2>Дерево</h2>
    <ul>

      <li>
        Дирекция (Дирекция)

        <ul>
          <li>
            Финансово-экономический департамент
            <ul>
              <li>Бухгалтерия (Отдел)</li>
              <li>Юристы (Отдел)</li>
              <li>Делопроизводство (Отдел)</li>
            </ul>
          </li>

          <li>
            Производственный департамент
            <ul>
              <li>Цех металлообработки</li>
              <li>Швейный цех</li>
            </ul>
          </li>

          <li>
            Департамент логистики
            <ul>
              <li>Отдел логистики</li>
              <li>Отдел закупок</li>
              <li>Склад</li>
              <li>Сборка швейных изделий</li>
              <li>Монтажные бригады</li>
            </ul>
          </li>

          <li>
            Департамент информационных технологий
            <ul>
              <li>Отдел разработки</li>
              <li>Отдел автоматизации</li>
              <li>Техническая поддержка</li>
            </ul>
          </li>

          <li>
            Коммерческий департамент
            <ul>
              <li>Отдел продаж и работы с клиентами</li>
              <li>Тендерный отдел</li>
              <li>Отдел работы с дилерами</li>
            </ul>
          </li>

          <li>
            Департамент маркетинга
            <ul>
              <li>Отдел стратегического развития</li>
              <li>Отдел интернет-маркетинга</li>
              <li>Контент-отдел</li>
            </ul>
          </li>
          <li>
            Отдел персонала (департамент без отделов)
          </li>
        </ul>

      </li>


    </ul>

    <h2>TODO::</h2>
    <p>
      Переделать структуру данных таким образом,
      <br>
      чтобы дирекция, департаменты и отделы были одной сущностью.
      <br>
      Разница между дирекцией, департаментом и отделом должна быть лишь визуальная.
      <br>
      Любой отдел, который вложен в другой отдел на любую глубину будет называться подотделом.
    </p>

    <h2>Поля для Дирекции (Directorate)</h2>
    <p>Существует в одном экземпляре</p>
    <ul>
      <li>Руководитель (hasOne Employee)</li>
      <li>Сотрудники (hasMany Employee)</li>
      <li>Департаменты (hasMany Departments)</li>
    </ul>

    <h2>Поля для Департамента (Department)</h2>
    <ul>
      <li>Название (Строка)</li>
      <li>Руководитель (hasOne Employee)</li>
      <li>Сотрудники (hasMany Employee)</li>
      <li>Директорат (hasOne Directorate)</li>
      <li>Отделы (hasMany Divisions)</li>
    </ul>

    <h2>Поля для отдела (Division)</h2>
    <ul>
      <li>Название (Строка)</li>
      <li>Руководитель (hasOne Employee)</li>
      <li>Сотрудники (hasMany Employee)</li>
      <li>Департамент (hasOne Department)</li>
    </ul>
  </div>
</template>

<style>

</style>
